echo off 
COLOR 2

Set f_Date=%Date% 
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2% 
Set f_Month=%f_Date:~3,2% 
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%


set cur_dir=%f_Year%\%f_Month%\%f_Day%
::set cur_dir=%f_Year%\%f_Month%\10


set dir_out=H:\fts
set dir_work=c:\FOIV_temp\FTS_364p\Out
set dir_arch=L:\arhiv_obmen\FTS\%cur_dir%
set DC=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\DC_EI\DC\%cur_dir%
set DC_KA=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\DC_EI\DC_KA\%cur_dir%
set DC_ARJ=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\DC_EI\DC_ARJ\%cur_dir%

md %dir_arch%

echo ----------------------------------------------------------------
echo --                 Полуавтоматическая отправка ЭКВТ           --
echo ----------------------------------------------------------------

echo 1. Коприуем PDF-файлы из DC в архив
COPY %DC%\*.pdf %dir_arch%

echo 2. Копируем PDF-файлы из DC в каталог для зашифровки
MOVE %DC%\*.pdf %dir_work%

echo 3. Копируем файлы sign из DC в каталог DC_KA
MOVE %DC%\*.sig %DC_KA%

echo ---------------------------------------------------------------
echo 4. Шифруем pdf-файлы через ПТК - НАСТРОЙКА 06 - СКАД Сигнатура!
echo ---------------------------------------------------------------
echo --                Инициализируем Ключ 01                     --
echo ---------------------------------------------------------------
echo --              Считываем папке OUT u Шифруем                --
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo --                 Выполнили шифрование?                     --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause

echo 5. Перемещаем файлы в каталог DC_KA
MOVE %dir_work%\*.* %DC_KA%

echo ---------------------------------------------------------------
echo --                 Первый этап выполнен                      --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo -- Ждем пока специалист ОРИВО выполнит свои манипуляции.     --
echo -- После того как она закончит, и сообщит - продолжаем.      --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause

echo 6. Копируем архивный файл из DC_ARJ в каталог для подписания
COPY %DC_ARJ%\*.arj %dir_work%


echo ---------------------------------------------------------------
echo 7. Подписываем архив arj через ПТК - Настройка 06 - СКАД Сигнатура!
echo ---------------------------------------------------------------
echo --                    Считываем папке OUT                    --
echo ---------------------------------------------------------------
echo --                   Нажимаем "Постановка КА                 --
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo --                 Выполнили "Постановка КА" ?               --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo ####### Если да, то для продолжения нажмите [Enter]     #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo --                    ДЕНЕЦИАЛИЗИРУЕМ КЛЮЧ!!                 --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######            Для продолжения нажмите [Enter]      #######
echo ---------------------------------------------------------------
pause

echo 8. Копируем подписанный архивный файл в архив
COPY %dir_work%\*.arj %dir_arch%

echo 9. Перемещаем файл в MailBox до завтра
MOVE %dir_work%\*.arj %dir_out%

echo ***************************************************************
echo ---------------------------------------------------------------
echo --             Второй этап сделан,всё, отправка завтра!!!    --
echo ---------------------------------------------------------------
echo --              Для завершения нажмите [Enter]               --
echo ---------------------------------------------------------------
echo ***************************************************************
pause