echo off 
COLOR 2

Set f_Date=%Date%
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2%
Set f_Month=%f_Date:~3,2%
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%
Set m_Date=%Date:.=%
Set m_Year=%f_Date:~8,4%

set archiv=L:\arhiv_obmen\FTS\1459\%f_Year%\%f_Month%\%f_Day%
set ESSF=L:\TBSVK\RVK_Kontrakt_3_0\IZ_FTS\353FZ\ESSF\

md %archiv%

echo  **************************************************
echo  ---------------------I Этап ---------------------- 
echo  ************************************************** 
echo  --------------------------------------------------
echo         1. Копируем полученные файлы в архив     --
echo  --------------------------------------------------

COPY Y:\F364\IN\ESSF*.arj %archiv%

echo  **************************************************
echo  2. Перемещаем файлы в каталог для снятия ЭЦП
echo  **************************************************

MOVE Y:\F364\IN\ESSF*.arj C:\FOIV_TEMP\FTS_364P\IN\

echo  --------------------------------------------------
echo  3. Необходимо выбрать в ПТК СКАД сигнатура      --
echo  --------------------------------------------------
echo  4. Выбрать настройку СКАД сигнатура - 04        --
echo  --------------------------------------------------
echo  5. Инициализируем ключ [01] для работы!         --
echo  --------------------------------------------------
echo  6. Ниже нажимаем "Считать"                      --
echo  --------------------------------------------------
echo  7. Затем нужно выполнить "Проверка КА"и"Снятие КА"
echo  --------------------------------------------------

pause

echo  **************************************************
echo  ##### Убедитесь что выполнили всё пошагово. 
echo  ##### "Проверка КА" и "Снятие КА". 
echo  ##### Нажмите [Enter] для завершения первого этапа 
echo  **************************************************

pause

echo  --------------------------------------------------
echo  4. Перемещаем файлы в каталог IZ_FTS
echo  --------------------------------------------------

MOVE C:\FOIV_TEMP\FTS_364P\IN\ESSF*.arj %ESSF%

echo  --------------------------------------------------
echo  ------- Говорим что Первый этап сделан --[Enter]--
echo  --------------------------------------------------

pause 

echo  --------------------------------------------------
echo  Должны услышать от операциониста, что первый этап 
echo  -- завершен. Как только получили ответ нажимаем -- 
echo  -- [Enter] для продолжения, начнётся второй этап--
echo  -------------------------------------------------- 
pause

echo off 
COLOR 2

Set f_Date=%Date% 
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2% 
Set f_Month=%f_Date:~3,2% 
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%

set SF_KA=L:\TBSVK\RVK_Kontrakt_3_0\IZ_FTS\353FZ\SF_KA\%f_Year%\%f_Month%\%f_Day%
set SF=L:\TBSVK\RVK_Kontrakt_3_0\IZ_FTS\353FZ\SF\%f_Year%\%f_Month%\%f_Day%
rem set SF_KA=L:\TBSVK\RVK_Kontrakt_3_0\IZ_FTS\353FZ\SF_KA\2014\09\30
rem  SF=L:\TBSVK\RVK_Kontrakt_3_0\IZ_FTS\353FZ\SF\2014\09\30

echo  **************************************************
echo  ---------------------II Этап---------------------- 
echo  **************************************************
echo  -------------------------------------------------- 
echo  1. Перемещаем файлы из SF в каталог для расшифровки
echo  -------------------------------------------------- 

MOVE %SF_KA%\*.* C:\FOIV_TEMP\FTS_364P\IN\

echo  --------------------------------------------------
echo  Нажимаем "Считать" файлы в графе "IN"
echo  -------------------------------------------------- 
echo  Расшифровываем снимаем подпись через ПТК - Настройка 04 - СКАД Сигнатура!
echo  -------------------------------------------------- 
echo  Выполняем теперь ниже действия пошагово         --
echo  "Расшифровка" и "Проверка КА" и "Снятие КА"     --
echo  --------------------------------------------------
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ##########
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo    Убедитесь, в том что вы сделали все моменты.  --
echo  --------------------------------------------------
echo  --------------------------------------------------
echo    "Расшифровка" и "Проверка КА" и "Снятие КА"   --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ##########
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo  4. Перемещаем файлы в SF
echo  --------------------------------------------------

MOVE C:\FOIV_TEMP\FTS_364P\IN\*.* %SF%

echo  --------------------------------------------------
echo         Говорим, что второй этап выполнен        --
echo    Ждём пока операционист выполнит свои манипуляции
echo      и сообщит о том что она всё сделала         --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ##########
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo  ДОЖДЁМСЯ как она сделает II Этап,начнется III Этап
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause


echo off 
COLOR 2

Set f_Date=%Date% 
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2% 
Set f_Month=%f_Date:~3,2% 
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%


set KVIT=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KVIT\%f_Year%\%f_Month%\%f_Day%
set KESSF=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KESSF\%f_Year%\%f_Month%\%f_Day%

rem set KVIT=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KVIT\2014\09\30
rem KESSF=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KESSF\2014\09\30

echo 1. Перемещаем файлы из KVIT в каталог для шифровки
MOVE %KVIT%\*.* C:\FOIV_TEMP\FTS_364P\OUT\

echo  **************************************************
echo  --------------------III Этап----------------------
echo  ************************************************** 
echo  --------------------------------------------------
echo  2.Переходим ниже в поле OUT нажимаем "Считать"
echo    ЕСЛИ ОТПРАВЛЯЕМ ЧЕРЕЗ ДЕЛЬТУ ТО ПОДПИСЬ НЕ СТАВИМ
echo    ПРОСТО ЗАКАНЧИВАЕМ СКРИПТ
echo  --------------------------------------------------
echo    Подписываем квитанции через ПТК - Настройка 04-- 
echo    Настройка 04 - СКАД Сигнатура!                --
echo    Ниже Нажимаем "Постановка КА" и всё.          --
echo    После того как нажали подписываются квитанции --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo     Выполнили "Постановка КА"?                   --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo  3. Перемещаем файлы в KESSF
echo  --------------------------------------------------

MOVE C:\FOIV_TEMP\FTS_364P\OUT\*.* %KESSF%

echo  --------------------------------------------------
echo         Говорим, что третий этап выполнен        --
echo   Ждём пока операционист выполнит свои манипуляции
echo      и сообщит о том что она всё сделала         --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ##########
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo  ДОЖДЁМСЯ как она сделает III Этап,начнется IV Этап
echo  Она скажет, что можно отправлять.И начнется IV Этап
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo off 
COLOR 2

Set f_Date=%Date% 
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2% 
Set f_Month=%f_Date:~3,2% 
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%

set KESSF=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KESSF\%f_Year%\%f_Month%\%f_Day%
set archiv=l:\arhiv_obmen\FTS\1459\%f_Year%\%f_Month%\%f_Day%

echo  **************************************************
echo  --------------------IV Этап----------------------- 
echo  **************************************************
echo  --------------------------------------------------
echo  1. Перемещаем архивный файл из KESSF в каталог для подписания
ping  localhost -n 10
echo  --------------------------------------------------

MOVE %KESSF%\KESSF*.arj C:\FOIV_TEMP\FTS_364P\OUT\

echo  --------------------------------------------------
echo  2. Подписываем архив через ПТК - Настройка 04 - СКАД Сигнатура!
echo    ЕСЛИ ОТПРАВЛЯЕМ ЧЕРЕЗ ДЕЛЬТУ ТО ПОДПИСЬ НЕ СТАВИМ
echo    ПРОСТО ЗАКАНЧИВАЕМ СКРИПТ
echo    В поле OUT Занаво считываем файл 
echo    И нажимаем ниже "Постановка КА"
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo       Убедитесь что сделали "Постановка КА"
echo     как только проверили всё, нажимаете [Enter]
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo off

echo 3. Копируем подписанный архивный файл в архив
COPY C:\FOIV_TEMP\FTS_364P\OUT\KESSF*.arj %archiv%

echo 4. Перемещаем файл в каталог на отправку
rem MOVE C:\FOIV_TEMP\FTS_364P\OUT\KESSF*.arj c:\ObmenPTK\OutFS
MOVE C:\FOIV_TEMP\FTS_364P\OUT\KESSF*.arj F:\output\foiv-sz\answer

pause

echo  --------------------------------------------------
echo    После того как все этапы выполнены            --
echo    Необходимо денециализировать ключ,            --
echo    и выполнить перезапуск ПТК!                   --
echo    Важно, так как он автоматом подписыват[01]ключ--
echo    Закрываем батник перезапускаем ПТК на [00]ключ--
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause