echo off 
COLOR 2

Set f_Date=%Date%
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2%
Set f_Month=%f_Date:~3,2%
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%
Set m_Date=%Date:.=%
Set m_Year=%f_Date:~8,4%

set archiv=L:\arhiv_obmen\FTS\1459\%f_Year%\%f_Month%\%f_Day%
set ESSF=L:\TBSVK\RVK_Kontrakt_3_0\IZ_FTS\353FZ\ESSF\

md %archiv%

echo  --------------------------------------------------
echo         Говорим, что второй этап выполнен        --
echo    Ждём пока операционист выполнит свои манипуляции
echo      и сообщит о том что она всё сделала         --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ##########
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo  ДОЖДЁМСЯ как она сделает II Этап,начнется III Этап
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause


echo off 
COLOR 2

Set f_Date=%Date% 
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2% 
Set f_Month=%f_Date:~3,2% 
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%


set KVIT=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KVIT\%f_Year%\%f_Month%\%f_Day%
set KESSF=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KESSF\%f_Year%\%f_Month%\%f_Day%

rem set KVIT=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KVIT\2014\09\30
rem KESSF=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KESSF\2014\09\30

echo 1. Перемещаем файлы из KVIT в каталог для шифровки
MOVE %KVIT%\*.* C:\FOIV_TEMP\FTS_364P\OUT\

echo  **************************************************
echo  --------------------III Этап----------------------
echo  ************************************************** 
echo  --------------------------------------------------
echo  2.Переходим ниже в поле OUT нажимаем "Считать"
echo    ЕСЛИ ОТПРАВЛЯЕМ ЧЕРЕЗ ДЕЛЬТУ ТО ПОДПИСЬ НЕ СТАВИМ
echo    ПРОСТО ЗАКАНЧИВАЕМ СКРИПТ
echo  --------------------------------------------------
echo    Подписываем квитанции через ПТК - Настройка 04-- 
echo    Настройка 04 - СКАД Сигнатура!                --
echo    Ниже Нажимаем "Постановка КА" и всё.          --
echo    После того как нажали подписываются квитанции --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo     Выполнили "Постановка КА"?                   --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo  3. Перемещаем файлы в KESSF
echo  --------------------------------------------------

MOVE C:\FOIV_TEMP\FTS_364P\OUT\*.* %KESSF%

echo  --------------------------------------------------
echo         Говорим, что третий этап выполнен        --
echo   Ждём пока операционист выполнит свои манипуляции
echo      и сообщит о том что она всё сделала         --
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ##########
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo  ДОЖДЁМСЯ как она сделает III Этап,начнется IV Этап
echo  Она скажет, что можно отправлять.И начнется IV Этап
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo off 
COLOR 2

Set f_Date=%Date% 
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2% 
Set f_Month=%f_Date:~3,2% 
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%

set KESSF=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\353FZ\KESSF\%f_Year%\%f_Month%\%f_Day%
set archiv=l:\arhiv_obmen\FTS\1459\%f_Year%\%f_Month%\%f_Day%

echo  **************************************************
echo  --------------------IV Этап----------------------- 
echo  **************************************************
echo  --------------------------------------------------
echo  1. Перемещаем архивный файл из KESSF в каталог для подписания
ping  localhost -n 10
echo  --------------------------------------------------

MOVE %KESSF%\KESSF*.arj C:\FOIV_TEMP\FTS_364P\OUT\

echo  --------------------------------------------------
echo  2. Подписываем архив через ПТК - Настройка 04 - СКАД Сигнатура!
echo    ЕСЛИ ОТПРАВЛЯЕМ ЧЕРЕЗ ДЕЛЬТУ ТО ПОДПИСЬ НЕ СТАВИМ
echo    ПРОСТО ЗАКАНЧИВАЕМ СКРИПТ
echo    В поле OUT Занаво считываем файл 
echo    И нажимаем ниже "Постановка КА"
echo  --------------------------------------------------

pause

echo  --------------------------------------------------
echo       Убедитесь что сделали "Постановка КА"
echo     как только проверили всё, нажимаете [Enter]
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause

echo off

echo 3. Копируем подписанный архивный файл в архив
COPY C:\FOIV_TEMP\FTS_364P\OUT\KESSF*.arj %archiv%

echo 4. Перемещаем файл в каталог на отправку
rem MOVE C:\FOIV_TEMP\FTS_364P\OUT\KESSF*.arj c:\ObmenPTK\OutFS
MOVE C:\FOIV_TEMP\FTS_364P\OUT\KESSF*.arj F:\output\foiv-sz\answer

pause

echo  --------------------------------------------------
echo    После того как все этапы выполнены            --
echo    Необходимо денециализировать ключ,            --
echo    и выполнить перезапуск ПТК!                   --
echo    Важно, так как он автоматом подписыват[01]ключ--
echo    Закрываем батник перезапускаем ПТК на [00]ключ--
echo  --------------------------------------------------
echo  ##########    [Enter] для продолжения   ########## 
echo  --------------------------------------------------

pause