echo off 
COLOR 2

Set f_Date=%Date% 
Set f_Time=%Time%
Set f_Day=%f_Date:~0,2% 
Set f_Month=%f_Date:~3,2% 
Set f_Year=%f_Date:~6,4%
Set f_Month=%f_Month: =%
Set f_Day=%f_Day: =%

set cur_dir=%f_Year%\%f_Month%\%f_Day%

set dir_in=L:\TBSVK\RVK_Kontrakt_3_0\B_FTS\PS_EI\%cur_dir%
set dir_out=H:\fts
set dir_work=c:\FOIV_temp\FTS_364p\Out
set dir_arch=L:\arhiv_obmen\FTS\%cur_dir%

md %dir_arch%

echo ----------------------------------------------------------------
echo --                 Полуавтоматическая отправка ЭCВТ           --
echo ----------------------------------------------------------------

echo 1. Коприуем файлы из PSEI в архив
::COPY %dir_in%\*.xml %dir_arch%

echo 2. Перемещаем файлы из PSEI в каталог для зашифровки
MOVE %dir_in%\*.xml %dir_work%\

echo ***************************************************************
echo ---------------------------------------------------------------
echo 3. Шифруем xml-файлы через ПТК - НАСТРОЙКА 06 - СКАД Сигнатура!
echo ---------------------------------------------------------------
echo --                Инициализируем Ключ 01                     --
echo ---------------------------------------------------------------
echo --              Считываем папке OUT и Шифруем                --
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo --                 Выполнили шифрование?                     --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause

echo 4. Перемещаем файлы обратно в PSEI
MOVE %dir_work%\*.xml %dir_in%

echo ---------------------------------------------------------------
echo --                 Первый этап выполнен                      --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo -- Ждем пока специалист ОРИВО выполнит свои манипуляции.     --
echo -- После того как она закончит, и сообщит - продолжаем.      --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause

echo 5. Копируем архивный файл из PSEI в каталог для подписания
COPY %dir_in%\PSEI*.arj %dir_work%\

echo ---------------------------------------------------------------
echo 6. Подписываем xml-файлы через ПТК - НАСТРОЙКА 06 - СКАД Сигнатура!
echo ---------------------------------------------------------------
echo --                    Считываем папке OUT                    --
echo ---------------------------------------------------------------
echo --                   Нажимаем "Постановка КА                 --
echo ---------------------------------------------------------------
echo #######       Для продолжения нажмите [Enter]           #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo --                 Выполнили "Постановка КА" ?               --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo ####### Если да, то для продолжения нажмите [Enter]     #######
echo ---------------------------------------------------------------
pause
echo ---------------------------------------------------------------
echo --                    ДЕНЕЦИАЛИЗИРУЕМ КЛЮЧ!!                 --
echo ---------------------------------------------------------------
echo ---------------------------------------------------------------
echo #######           Для продолжения нажмите [Enter]       #######
echo ---------------------------------------------------------------
pause

echo 7. Копируем подписанный архивный файл в архив
COPY %dir_work%\*.arj %dir_arch%

echo 8. Перемещаем файл в MailBox до завтра
MOVE %dir_work%\*.arj %dir_out%

echo ***************************************************************
echo ---------------------------------------------------------------
echo --             Второй этап сделан,всё, отправка завтра!!!    --
echo ---------------------------------------------------------------
echo --              Для завершения нажмите [Enter]               --
echo ---------------------------------------------------------------
echo ***************************************************************
pause